import ru.otus.handler.ComplexProcessor;
import ru.otus.model.Message;
import ru.otus.model.ObjectForMessage;
import ru.otus.processor.LoggerProcessor;
import ru.otus.processor.ProcessorConcatFields;
import ru.otus.processor.ProcessorUpperField10;
import ru.otus.processor.homework.ChangeProcessor;
import ru.otus.processor.homework.ExceptionProcessor;
import ru.otus.processor.homework.TimeProvider;
import ru.otus.processor.homework.TimeProviderImpl;

import java.time.LocalDateTime;
import java.util.List;

public class HomeWork {

    /*
     Реализовать to do:
       1. Добавить поля field11 - field13 (для field13 используйте класс ObjectForMessage)
       2. Сделать процессор, который поменяет местами значения field11 и field12
       3. Сделать процессор, который будет выбрасывать исключение в четную секунду (сделайте тест с гарантированным результатом)
            Секунда должна определяьться во время выполнения.
       4. Сделать Listener для ведения истории: старое сообщение - новое (подумайте, как сделать, чтобы сообщения не портились)
     */

    public static void main(String[] args) {
        TimeProvider timeProvider = new TimeProviderImpl();
        var processors = List.of(
                new ChangeProcessor(),
                new ExceptionProcessor(timeProvider));

        var complexProcessor = new ComplexProcessor(processors, (ex) -> {
        });
        ObjectForMessage objectForMessage = new ObjectForMessage();
        objectForMessage.setData(List.of("field13"));
        var message = new Message.Builder(1L)
                .field11("field11")
                .field12("field12")
                .field13(objectForMessage)
                .build();

        var result = complexProcessor.handle(message);
        System.out.println("result:" + result);

    }

}
